import type { IIconComponentProps } from "./types.js"

/**
 * SVG-иконка с поддержкой динамического цвета.
 */
export const OkFilledIcon = ({
	color = "var(--icon-color, currentColor)",
	secondaryColor: _secondaryColor,
	...svgProps
}: IIconComponentProps) => (
	<svg {...svgProps} fill="none" viewBox="0 0 24 24" width="100%" height="100%">
		<path
			fill={color}
			d="M12.002 5.679c1.017 0 1.845.809 1.845 1.803 0 .99-.828 1.8-1.845 1.8-1.018 0-1.846-.81-1.846-1.8 0-.994.828-1.803 1.846-1.803m0 6.281c2.53 0 4.582-2.006 4.582-4.478S14.531 3 12.002 3 7.415 5.01 7.415 7.482c0 2.469 2.057 4.478 4.587 4.478m1.802 3.425a8.3 8.3 0 0 0 2.587-1.047c.61-.375.792-1.162.409-1.758a1.32 1.32 0 0 0-1.8-.399 5.77 5.77 0 0 1-5.997 0 1.323 1.323 0 0 0-1.803.4c-.383.595-.2 1.382.412 1.757.803.497 1.68.847 2.587 1.047l-2.493 2.437a1.253 1.253 0 0 0 .003 1.803 1.324 1.324 0 0 0 1.845 0l2.448-2.391 2.45 2.391a1.33 1.33 0 0 0 1.846 0 1.256 1.256 0 0 0 0-1.803z"
		/>
	</svg>
)

export default OkFilledIcon
